grevaillot/svd_tools/headers/STM32H7x5_CM4/nvic.h
#pragma once 

/* --- NVIC: Nested Vectored Interrupt Controller ------------------- */

/** @defgroup nvic_registers Nested Vectored Interrupt
      Controller Register
@{*/

/** NVIC_ISER0 Interrupt Set-Enable Register **/
#define NVIC_ISER0			MMIO32(NVIC_BASE + 0x00)
/** NVIC_ISER1 Interrupt Set-Enable Register **/
#define NVIC_ISER1			MMIO32(NVIC_BASE + 0x04)
/** NVIC_ISER2 Interrupt Set-Enable Register **/
#define NVIC_ISER2			MMIO32(NVIC_BASE + 0x08)
/** NVIC_ISER3 Interrupt Set-Enable Register **/
#define NVIC_ISER3			MMIO32(NVIC_BASE + 0x0c)
/** NVIC_ICER0 Interrupt Clear-Enable Register **/
#define NVIC_ICER0			MMIO32(NVIC_BASE + 0x80)
/** NVIC_ICER1 Interrupt Clear-Enable Register **/
#define NVIC_ICER1			MMIO32(NVIC_BASE + 0x84)
/** NVIC_ICER2 Interrupt Clear-Enable Register **/
#define NVIC_ICER2			MMIO32(NVIC_BASE + 0x88)
/** NVIC_ICER3 Interrupt Clear-Enable Register **/
#define NVIC_ICER3			MMIO32(NVIC_BASE + 0x8c)
/** NVIC_ISPR0 Interrupt Set-Pending Register **/
#define NVIC_ISPR0			MMIO32(NVIC_BASE + 0x100)
/** NVIC_ISPR1 Interrupt Set-Pending Register **/
#define NVIC_ISPR1			MMIO32(NVIC_BASE + 0x104)
/** NVIC_ISPR2 Interrupt Set-Pending Register **/
#define NVIC_ISPR2			MMIO32(NVIC_BASE + 0x108)
/** NVIC_ISPR3 Interrupt Set-Pending Register **/
#define NVIC_ISPR3			MMIO32(NVIC_BASE + 0x10c)
/** NVIC_ICPR0 Interrupt Clear-Pending Register **/
#define NVIC_ICPR0			MMIO32(NVIC_BASE + 0x180)
/** NVIC_ICPR1 Interrupt Clear-Pending Register **/
#define NVIC_ICPR1			MMIO32(NVIC_BASE + 0x184)
/** NVIC_ICPR2 Interrupt Clear-Pending Register **/
#define NVIC_ICPR2			MMIO32(NVIC_BASE + 0x188)
/** NVIC_ICPR3 Interrupt Clear-Pending Register **/
#define NVIC_ICPR3			MMIO32(NVIC_BASE + 0x1c0)
/** NVIC_IABR0 Interrupt Active Bit Register **/
#define NVIC_IABR0			MMIO32(NVIC_BASE + 0x200)
/** NVIC_IABR1 Interrupt Active Bit Register **/
#define NVIC_IABR1			MMIO32(NVIC_BASE + 0x204)
/** NVIC_IABR2 Interrupt Active Bit Register **/
#define NVIC_IABR2			MMIO32(NVIC_BASE + 0x208)
/** NVIC_IABR3 Interrupt Active Bit Register **/
#define NVIC_IABR3			MMIO32(NVIC_BASE + 0x20c)
/** NVIC_IPR0 Interrupt Priority Register **/
#define NVIC_IPR0			MMIO32(NVIC_BASE + 0x300)
/** NVIC_IPR1 Interrupt Priority Register **/
#define NVIC_IPR1			MMIO32(NVIC_BASE + 0x304)
/** NVIC_IPR2 Interrupt Priority Register **/
#define NVIC_IPR2			MMIO32(NVIC_BASE + 0x308)
/** NVIC_IPR3 Interrupt Priority Register **/
#define NVIC_IPR3			MMIO32(NVIC_BASE + 0x30c)
/** NVIC_IPR4 Interrupt Priority Register **/
#define NVIC_IPR4			MMIO32(NVIC_BASE + 0x310)
/** NVIC_IPR5 Interrupt Priority Register **/
#define NVIC_IPR5			MMIO32(NVIC_BASE + 0x314)
/** NVIC_IPR6 Interrupt Priority Register **/
#define NVIC_IPR6			MMIO32(NVIC_BASE + 0x318)
/** NVIC_IPR7 Interrupt Priority Register **/
#define NVIC_IPR7			MMIO32(NVIC_BASE + 0x31c)
/** NVIC_IPR8 Interrupt Priority Register **/
#define NVIC_IPR8			MMIO32(NVIC_BASE + 0x320)
/** NVIC_IPR9 Interrupt Priority Register **/
#define NVIC_IPR9			MMIO32(NVIC_BASE + 0x324)
/** NVIC_IPR10 Interrupt Priority Register **/
#define NVIC_IPR10			MMIO32(NVIC_BASE + 0x328)
/** NVIC_IPR11 Interrupt Priority Register **/
#define NVIC_IPR11			MMIO32(NVIC_BASE + 0x32c)
/** NVIC_IPR12 Interrupt Priority Register **/
#define NVIC_IPR12			MMIO32(NVIC_BASE + 0x330)
/** NVIC_IPR13 Interrupt Priority Register **/
#define NVIC_IPR13			MMIO32(NVIC_BASE + 0x334)
/** NVIC_IPR14 Interrupt Priority Register **/
#define NVIC_IPR14			MMIO32(NVIC_BASE + 0x338)
/** NVIC_IPR15 Interrupt Priority Register **/
#define NVIC_IPR15			MMIO32(NVIC_BASE + 0x33c)
/** NVIC_IPR16 Interrupt Priority Register **/
#define NVIC_IPR16			MMIO32(NVIC_BASE + 0x340)
/** NVIC_IPR17 Interrupt Priority Register **/
#define NVIC_IPR17			MMIO32(NVIC_BASE + 0x344)
/** NVIC_IPR18 Interrupt Priority Register **/
#define NVIC_IPR18			MMIO32(NVIC_BASE + 0x348)
/** NVIC_IPR19 Interrupt Priority Register **/
#define NVIC_IPR19			MMIO32(NVIC_BASE + 0x34c)
/** NVIC_IPR20 Interrupt Priority Register **/
#define NVIC_IPR20			MMIO32(NVIC_BASE + 0x350)
/** NVIC_IPR21 Interrupt Priority Register **/
#define NVIC_IPR21			MMIO32(NVIC_BASE + 0x354)
/** NVIC_IPR22 Interrupt Priority Register **/
#define NVIC_IPR22			MMIO32(NVIC_BASE + 0x358)
/** NVIC_IPR23 Interrupt Priority Register **/
#define NVIC_IPR23			MMIO32(NVIC_BASE + 0x35c)
/** NVIC_IPR24 Interrupt Priority Register **/
#define NVIC_IPR24			MMIO32(NVIC_BASE + 0x360)
/** NVIC_IPR25 Interrupt Priority Register **/
#define NVIC_IPR25			MMIO32(NVIC_BASE + 0x364)
/** NVIC_IPR26 Interrupt Priority Register **/
#define NVIC_IPR26			MMIO32(NVIC_BASE + 0x368)
/** NVIC_IPR27 Interrupt Priority Register **/
#define NVIC_IPR27			MMIO32(NVIC_BASE + 0x36c)
/** NVIC_IPR28 Interrupt Priority Register **/
#define NVIC_IPR28			MMIO32(NVIC_BASE + 0x370)
/** NVIC_IPR29 Interrupt Priority Register **/
#define NVIC_IPR29			MMIO32(NVIC_BASE + 0x374)
/** NVIC_IPR30 Interrupt Priority Register **/
#define NVIC_IPR30			MMIO32(NVIC_BASE + 0x378)
/** NVIC_IPR31 Interrupt Priority Register **/
#define NVIC_IPR31			MMIO32(NVIC_BASE + 0x37c)
/** NVIC_IPR32 Interrupt Priority Register **/
#define NVIC_IPR32			MMIO32(NVIC_BASE + 0x380)
/** NVIC_IPR33 Interrupt Priority Register **/
#define NVIC_IPR33			MMIO32(NVIC_BASE + 0x384)
/** NVIC_IPR34 Interrupt Priority Register **/
#define NVIC_IPR34			MMIO32(NVIC_BASE + 0x388)
/** NVIC_IPR35 Interrupt Priority Register **/
#define NVIC_IPR35			MMIO32(NVIC_BASE + 0x38c)
/** NVIC_IPR36 Interrupt Priority Register **/
#define NVIC_IPR36			MMIO32(NVIC_BASE + 0x390)
/** NVIC_IPR37 Interrupt Priority Register **/
#define NVIC_IPR37			MMIO32(NVIC_BASE + 0x394)
/** NVIC_IPR38 Interrupt Priority Register **/
#define NVIC_IPR38			MMIO32(NVIC_BASE + 0x398)

/**@}*/


/** @defgroup nvic_iser0 ISER0 Interrupt Set-Enable Register
@{*/


#define NVIC_ISER0_SETENA_SHIFT		0
#define NVIC_ISER0_SETENA_MASK		0xffffffff
/** @defgroup nvic_iser0_setena SETENA SETENA
@{*/
/**@}*/


/**@}*/

/** @defgroup nvic_iser1 ISER1 Interrupt Set-Enable Register
@{*/


